---
layout: docs
page_title: coalesce - Functions - Configuration Language
sidebar_title: coalesce
description: |-
  The coalesce function takes any number of arguments and returns the
  first one that isn't null nor empty.
# START AUTO GENERATED METADATA, DO NOT EDIT
created_at: 2021-11-15T00:00:00.000Z
last_modified: 2021-11-15T00:00:00.000Z
# END AUTO GENERATED METADATA
---

# `coalesce` Function

`coalesce` takes any number of arguments and returns the first one
that isn't null or an empty string.

## Examples

```shell-session
> coalesce("a", "b")
a
> coalesce("", "b")
b
> coalesce(1,2)
1
```

To perform the `coalesce` operation with a list of strings, use the `...`
symbol to expand the list as arguments:

```shell-session
> coalesce(["", "b"]...)
b
```

## Related Functions

- [`coalescelist`](/docs/job-specification/hcl2/functions/collection/coalescelist) performs a similar operation with
  list arguments rather than individual arguments.
